**** intrap file
#+BEGIN_SRC lisp
(in-package #:penning-analysis)

(defparameter *in-file* (midas:read-mpet-midas-file "/intrap/20140914/run221831.mid"))


(defparameter *data-intrap*
  (tof-data:data *in-file* 1
		 :min-tof 10d0
		 :max-tof 22d0
		 :min-no-ions 1
		 :max-no-ions 2))


(let ((params (fp:get-init-params-from-midas-file
	       ,*in-file* :om-c-deviation 30d0
	       :rho-m0-sampler '(ba:gaussian-sampler :sigma 1d-5)
	       :om-c-sampler '(ba:gaussian-sampler :sigma 1d0)
	       :tof-offset-min 0.1d0 :tof-offset-max 1d0 :tof-offset 0.5d0
	       :p-interest-min 0.01d0
	       :p-interest-max 1d0
	       :p-interest 0.02d0
	       :contaminant-offset-max 40d0
	       :rho-m0 3d-4
	       :rho-m0-min 3d-4
	       :rho-m0-max 1d-3)))
  (defparameter *res-2d-intrap*
    (ba:find-optimum
     (make-instance 'ba:nlopt :max-time 15d0)
     (apply #'make-instance 'fp:2d-bayes-konig params)
     (ba:initialize-from-source 'fp:2d-tof-distribution *data-intrap*))))



(labels ((cmd (fmt-str &rest args)
	   (mgl-gnuplot:command (apply #'format nil fmt-str args))))
  (mgl-gnuplot:with-session ()
    (cmd "reset")
    (cmd "set terminal wxt enhanced font 'Georgia,8' dashed")
    (mgl-gnuplot:plot*
     (list
      (mgl-gnuplot:data*
       (let+ (((&slots ba:input-model ba:model ba:data) *res-2d-intrap*))
	 (ba:plot-result-models ba:input-model ba:model ba:data :include-input-model nil))
       "with lines"))) 
    (cmd "unset output")))


#+END_SRC

#+RESULTS:
: unset output

*** logbook
- o.k., it finds the minimum but I can't plot the distributions
- maybe because of the cache ?
- no, likely because the log is to small
- so, maybe normalize in the log scale
- now getting division-by-zero when calculating likelihood
- maybe use same trick as for sumlogexp
- formula is:
  \begin{equation}
  \label{eq:4}
  \frac{1}{\sqrt{2\pi}\sigma}
  \left(
        \exp \left[-\frac{\left( T - \mu \left( \omega_{RF} \right)\right)^2}{2\sigma^2} \right]
  + \exp \left[ -\frac{ \left( T - T_{cont}\right)^2}{2\sigma^2} \right]
  \right)
  \end{equation}
- why does this go to zero anyway ?
- ok, ignore datapoints that would give a likelihood of zero, then it works
- now, let's try some of the in-trap data
- so, that works, but I have to limit the tof range quite
  dramatically, since there is pretty big tail on the peaks
- so, maybe introduce a asymmetrical gaussian ?
- yeah, let's do that
- o.k., looking at the 2d konig I have been using, there are quite some errors in it,
- let's fix that first
- ok, this seems to make more sense, but let's test it before judging
- it still fits appropriately, but let's seperate the too distribution
  width, as the background seems to be much broader
- mmh, that didn't work too well, am I actually using the skew ? *->*
  yes, I am, but not the contaminant-sigma
- when using the contaminant-sigma, the optimization is running out of
  time
- I think at least, since I do not know the nlopt result values by
  heart, let's change what we store in the result to the symbols
  instead
- yeah, running out of time
- so, how much time would it need *->* setting limit to 15s and trying
- oh, ok, 5.37s let's look at the output -- writing a small function
  to output model to org-table
- for that, clone org-integration into penning-trap project
- done, also finished function to return org-mode table
- not working, no real table, do it after the break
- testing it with the following:
  #+BEGIN_SRC lisp :results output raw
  (in-package #:penning-analysis)

  (let+ ((model (ba:model *res-2d-intrap*))
         ((&slots ba:all-model-parameters
                  ba:model-parameters-to-marginalize) model))
    (org-mode-integration:output-slots model
                                       (list ba:model-parameters-to-marginalize
                                             (set-difference ba:all-model-parameters
                                                             ba:model-parameters-to-marginalize))
                                       :slot-value-format "~f"))
  #+END_SRC

  #+RESULTS:
  |--------------------+-----------------------|
  | OM-C               |    130961670.86165124 |
  | RHO-M0             | 0.0003000108917287551 |
  | ALPHA              |    0.9999308259956416 |
  | TOF-OFFSET         |    0.3702480012236808 |
  | SIGMA              |    1.3473790781085464 |
  | SIGMA-CONTAMINANT  |    3.5483153004972507 |
  | P-INTEREST         |   0.31396479322945614 |
  | CONTAMINANT-OFFSET |    18.110909561877484 |
  |--------------------+-----------------------|
  | Z-END              |                 1.149 |
  | Z-START            |                   0.0 |
  | DELTA-PHI          |                   0.0 |
  | DAMPING            |                   0.0 |
  | RHO-P0             |             0.0000001 |
  | NO-CONV            |                   1.0 |
  | T-RF               |                  0.02 |
  | V-0                |    0.2836629599463937 |
  | E-0                |                   1.0 |
  | B-MAX              |                   3.7 |
  | OM-RF              |    130962485.95913957 |
  | OM-M               |     38573.73123783692 |
  | Q                  |                  11.0 |
  |--------------------+-----------------------|
- o.k, it fits alpha to be basically one, which would make it
  superflous
- let's remove it and replace it with a gaussian to see what happens
- well, it is a lot slower than what I had before for some reason
- let's not get hung up on performance for now, but look at the values
  #+BEGIN_SRC lisp :results output raw
  (in-package #:penning-analysis)

  (let+ ((model (ba:model *res-2d-intrap*))
         ((&slots ba:all-model-parameters
                  ba:model-parameters-to-marginalize) model))
    (org-mode-integration:output-slots model
                                       (list ba:model-parameters-to-marginalize
                                             (set-difference ba:all-model-parameters
                                                             ba:model-parameters-to-marginalize))
                                       :slot-value-format "~f"))
  #+END_SRC

  #+RESULTS:
  |--------------------+------------------------|
  | OM-C               |      130961670.6118449 |
  | RHO-M0             | 0.00030002348100134223 |
  | TOF-OFFSET         |     0.5327740057967829 |
  | SIGMA              |      1.468445725050243 |
  | SIGMA-CONTAMINANT  |     3.1767201946065273 |
  | P-INTEREST         |    0.42172914305335285 |
  | CONTAMINANT-OFFSET |     20.361997008836813 |
  |--------------------+------------------------|
  | Z-END              |                  1.149 |
  | Z-START            |                    0.0 |
  | DELTA-PHI          |                    0.0 |
  | DAMPING            |                    0.0 |
  | RHO-P0             |              0.0000001 |
  | NO-CONV            |                    1.0 |
  | T-RF               |                   0.02 |
  | V-0                |     0.2836629599463937 |
  | E-0                |                    1.0 |
  | B-MAX              |                    3.7 |
  | OM-RF              |     130962485.95913957 |
  | OM-M               |      38573.73123783692 |
  | Q                  |                   11.0 |
  |--------------------+------------------------|
- is there a difference in performance of the fit (not how long it
  takes) when using two different sigmas ?
- not using two sigmas
    #+BEGIN_SRC lisp :results output raw
  (in-package #:penning-analysis)

  (let+ ((model (ba:model *res-2d-intrap*))
         ((&slots ba:all-model-parameters
                  ba:model-parameters-to-marginalize) model))
    (org-mode-integration:output-slots model
                                       (list ba:model-parameters-to-marginalize
                                             (set-difference ba:all-model-parameters
                                                             ba:model-parameters-to-marginalize))
                                       :slot-value-format "~f"))
  #+END_SRC

  #+RESULTS:
  |--------------------+------------------------|
  | OM-C               |     130961670.56097616 |
  | RHO-M0             | 0.00030170065806623287 |
  | TOF-OFFSET         |     0.9635835898867411 |
  | SIGMA              |     2.7650410715412903 |
  | P-INTEREST         |    0.07539610131072237 |
  | CONTAMINANT-OFFSET |     19.614364357359044 |
  |--------------------+------------------------|
  | Z-END              |                  1.149 |
  | Z-START            |                    0.0 |
  | DELTA-PHI          |                    0.0 |
  | DAMPING            |                    0.0 |
  | RHO-P0             |              0.0000001 |
  | NO-CONV            |                    1.0 |
  | T-RF               |                   0.02 |
  | V-0                |     0.2836629599463937 |
  | E-0                |                    1.0 |
  | B-MAX              |                    3.7 |
  | OM-RF              |     130962485.95913957 |
  | OM-M               |      38573.73123783692 |
  | Q                  |                   11.0 |
  |--------------------+------------------------|
- well, a lot faster and 0.3 Hz different in sigma
- how big is the difference to a run where I cut out most of the tail ?
  Setting :max-tof = 22
- ok, *NA:* looking at performance, specifically start profiling
  distribution generating stuff
- profiling, let's start by looking at the hessian
  #+BEGIN_SRC lisp :results none
  (in-package #:penning-analysis)

  (defparameter *in-file* (midas:read-mpet-midas-file "/intrap/20140914/run221831.mid"))

  (defparameter *data-intrap-performance*
    (tof-data:data *in-file*
                   1
                   :min-tof 10d0
                   :max-tof 22d0
                   :min-no-ions 1
                   :max-no-ions 2))

  (let ((params (fp:get-init-params-from-midas-file
                 ,*in-file* :om-c-deviation 30d0
                 :rho-m0-sampler '(ba:gaussian-sampler :sigma 1d-5)
                 :om-c-sampler '(ba:gaussian-sampler :sigma 1d0)
                 :tof-offset-min -5d0 :tof-offset-max 5d0 :tof-offset 0.5d0
                 :p-interest-min 0.01d0
                 :p-interest-max 1d0
                 :p-interest 0.02d0
                 :contaminant-offset-max 40d0
                 :rho-m0 3d-4
                 :rho-m0-min 3d-4
                 :rho-m0-max 1d-3)))
    (defparameter *res-2d-intrap-performance*
      (ba:find-optimum
       (make-instance 'ba:nlopt :max-time 15d0)
       (apply #'make-instance 'fp:2d-bayes-konig params)
       (ba:initialize-from-source 'fp:2d-tof-distribution *data-intrap-performance*))))





  (labels ((cmd (fmt-str &rest args)
             (mgl-gnuplot:command (apply #'format nil fmt-str args))))
    (mgl-gnuplot:with-session ()
      (cmd "reset")
      (cmd "set terminal wxt enhanced font 'Georgia,8' dashed")
      (mgl-gnuplot:plot*
       (list
        (mgl-gnuplot:data*
         (let+ (((&slots ba:input-model ba:model ba:data) *res-2d-intrap-performance*))
           (ba:plot-result-models ba:input-model ba:model ba:data :include-input-model nil))
         "with lines"))) 
      (cmd "unset output")))


  (sb-profile:profile ba:get-parameter-results ba::get-variance-for-param ba::hessian ba::%do-f-max
                      make-array fp::2d-bayes-konig-model-function)

  (ba:get-parameter-results *res-2d-intrap-performance* :no-bins 20)


  (sb-profile:report)
  #+END_SRC
- starting to profile here
- so, from the above it turns out that we spent most of the time
  calculating the hessian: 
| seconds |    gc | consed        | calls | sec/call | name                                      |
|---------+-------+---------------+-------+----------+-------------------------------------------|
|  11.304 | 0.096 | 4,138,956,976 |   130 | 0.086953 | BAYESIAN-ANALYSIS::HESSIAN                |
|   0.240 | 0.000 | 67,423,520    |     1 | 0.239891 | BAYESIAN-ANALYSIS:GET-PARAMETER-RESULTS   |
|   0.228 | 0.012 | 64,938,224    |   124 | 0.001838 | BAYESIAN-ANALYSIS::%DO-F-MAX              |
|   0.000 | 0.000 | 163,792       |     6 | 0.000000 | BAYESIAN-ANALYSIS::GET-VARIANCE-FOR-PARAM |
|---------+-------+---------------+-------+----------+-------------------------------------------|
|  11.772 | 0.108 | 4,271,482,512 |   261 |          | Total                                     |
- and the hessian also conses an immense amount ...
- what is going on here ?
- let's start by adding declaration and then see if we can remove all
  this consing,
- so with that, it takes 50% longer for some reason, what the hell is
  going on here ?
- how much time does it spend in make-array ? *A:* basically none
- actually, let's create it's own point here

*** logbook
- let's start with easier repeatability, then continue with looking at
  nl-opt:optimization in terms of usage
- with that, examine what happens if we change stuff
- so, let's get a baseline on where we are:
  #+BEGIN_SRC lisp 
  (in-package #:penning-analysis)

  (f/performance-do-fit)
  (sb-profile::unprofile-all)
  (sb-profile:reset)
  (sb-profile:profile ba:get-parameter-results ba::get-variance-for-param
                      ba::hessian
                      ba::%do-f-max
                      make-array
                      ;fp::2d-bayes-konig-model-function
                      )

  (time
   (ba:get-parameter-results *res-2d-intrap-performance* :no-bins 20))

  #+END_SRC

  #+RESULTS:
  : #<BAYESIAN-ANALYSIS::OPTIMIZED-PARAMETERS {1010345333}>
- with the following result:
  | seconds |    gc | consed        |      calls | sec/call | name                                       |
  |---------+-------+---------------+------------+----------+--------------------------------------------|
  |  13.569 | 0.040 | 1,833,178,976 |        130 | 0.104376 | BAYESIAN-ANALYSIS::HESSIAN                 |
  |   6.997 | 0.048 | 2,369,177,696 | 50,061,312 | 0.000000 | FIT-PENNING::2D-BAYES-KONIG-MODEL-FUNCTION |
  |   0.205 | 0.000 | 32,341,840    |        124 | 0.001651 | BAYESIAN-ANALYSIS::%DO-F-MAX               |
  |   0.000 | 0.000 | 130,768       |          6 | 0.000000 | BAYESIAN-ANALYSIS::GET-VARIANCE-FOR-PARAM  |
  |   0.000 | 0.000 | 36,168,976    |          1 | 0.000000 | BAYESIAN-ANALYSIS:GET-PARAMETER-RESULTS    |
  |   0.000 | 0.000 | 32,752        |        272 | 0.000000 | MAKE-ARRAY                                 |
  |---------+-------+---------------+------------+----------+--------------------------------------------|
  |  20.771 | 0.088 | 4,271,031,008 | 50,061,845 |          | Total                                      |
- 2d-bayes-konig-model-function is consing 48 byte per call, which seems to be okay for now
- but why is it spending that much time in hessian still
- so, start to unfold this a bit by profiling what is now mostly lambdas
  #+BEGIN_SRC lisp
  (in-package #:penning-analysis)

  (f/performance-do-fit)
  (sb-profile::unprofile-all)
  (sb-profile:reset)
  (sb-profile:profile ba:get-parameter-results ba::get-variance-for-param
                      ba::hessian
                      ba::%do-f-max
                      ;fp::2d-bayes-konig-model-function
                      )

  (time
   (ba:get-parameter-results *res-2d-intrap-performance* :no-bins 20))

  #+END_SRC

- ok, so maybe do these two things:
  + change slot-value calls to array calls all the time
  + do not use a return value but a struct
- let's test this by hand first
- though, which seems to take a long time
- what I am doing ? plan:
- compare call to hand optimized version of
  2d-bayes-konig-model-function to non-optimized by calling a million
  times or so with real data
- while keeping an eye on the following:
  + same results
  + memory usage
  + execution time
- *after that:* see if we can make it even faster
- *then*, look at the likelihood funtions and see what can be done about
  them
- define function to create the array for the model 
- let's make the hand optimized model function actually work
- for that we need a model to get the parameters from
- split f/performance-do-fit into model creation and optimization function
- with that, we compare 10 million function calls:
  #+BEGIN_QUOTE
  PA> (fp::test-function)
  Evaluation took:
  0.585 seconds of real time
  0.584000 seconds of total run time (0.584000 user, 0.000000 system)
  99.83% CPU
  1,518,937,394 processor cycles
  160,006,144 bytes consed
  
  NIL
  PA> (fp::test-function2)
  Evaluation took:
  1.147 seconds of real time
  1.140000 seconds of total run time (1.128000 user, 0.012000 system)
  [ Run times consist of 0.008 seconds GC time, and 1.132 seconds non-GC time. ]
  99.39% CPU
  2,973,609,825 processor cycles
  479,999,536 bytes consed
  
  NIL
  #+END_QUOTE
- roughly half the time but still consing 16 byte per call, where though ?
- and how much does it matter ?
- first though, need to try it with static-vectors
- that works pretty well
- ok, let's integrate that into the code
- that means changing the slot-values to access to the array (maybe by
  index); where does this need to happen ?
  + [ ] priors
  + [ ] optimization function in general
- another idea would be to actually macroexpand the find-optimum
  methods, but let's look at that later
  
*** logbook
- [2017-05-16 Tue 10:33] continuing logbook here
- *problem:* the posterior distribution calculated for the laplacian
  seems to be dependent on the range -- at least for the tof-offset and rho-m0
- *also:* the determinant of the Fisher information matrix changes sign
- actually, let's first make sure that it still works at all 
- no, not really -- wish I had made a commit of the unfinished version
  of it
- so, what seems to be going on ? 
- firstly, it finds the correct minimum
- but the distribution for om-c is now flat (at zero)
- no, first, try to see what happens, to the fit, when fixing a
  parameter
  #+BEGIN_SRC lisp
  (in-package :penning-analysis)


  (labels ((cmd (fmt-str &rest args)
             (mgl-gnuplot:command (apply #'format nil fmt-str args)))
           (get-params ()
             (fp:get-init-params-from-midas-file *test-file* :om-c-deviation 10d0
                                                 :om-c-sample-sigma 0.5d0
                                                 :tof-offset-min -1d0
                                                 :tof-offset 0d0
                                                 :tof-offset-marginalize nil
                                                 :tof-offset-max 1d0
                                                 :tof-offset-sample-sigma 0.01d0
                                                 :rho-m0-marginalize t
                                                 :rho-m0-sample-sigma 1d-5)))
    (let+ ((data)
           (plots
            (iter
              (with k = (apply #'make-instance 'fp:bayes-konig (get-params)))
              (for tof-offset from -5d0 to 5d0 by 1d0)
              (setf (fp::tof-offset k) tof-offset)
              (for opt = (ba:find-optimum (make-instance 'ba:nlopt) k
                                          (ba:initialize-from-source 'fp:bayes-tof *d*)))
              (for res = (ba:get-parameter-results opt))
              (for (d input results) = (ba:plot-result-model res :enclose-in-plot nil))
              (setf data d)
              (collect results))))
      (mgl-gnuplot:with-session ()
        (cmd "reset")
        (cmd "set terminal x11 enhanced font 'Georgia,8' dashed")
        (mgl-gnuplot:plot*
         (append (list data) plots))
        (cmd "unset output"))))

  (labels ((get-params ()
             (fp:get-init-params-from-midas-file *test-file* :om-c-deviation 10d0
                                                 :om-c-sample-sigma 0.5d0
                                                 :rho-m0 1d-4
                                                 :tof-offset-marginalize nil)))
                                                 (iter
      (with k = (apply #'make-instance 'fp:bayes-konig (get-params)))
      (for tof-offset from -1d0 to 1d0 by 0.1d0)
      (setf (fp::tof-offset k) tof-offset)
      (for opt = (ba:find-optimum (make-instance 'ba:nlopt) k
                                  (ba:initialize-from-source 'fp:bayes-tof *d*)))
      (collect (list (ba::nlopt-result opt)
                     (ba::f-val opt)
                     tof-offset))))
  #+END_SRC

  #+RESULTS:
  : unset output
- ok, that seems to make sense to me
- let's look at copy object and see if we can amend it so it updates specific values
- [2017-05-17 Wed 10:30] that made it work somehow
- now, the determinant is still a problem ... let's fix that
- [2017-05-18 Thu 16:10] seems, that the determinant isn't really a
  problem (just taking the absolute, seems to work) and the inverse is
  working now as well
- commiting: [[orgit-rev:~/phd/src/penning-analysis.project/bayesian-analysis/::56ae9f2][~/phd/src/penning-analysis.project/bayesian-analysis/ (magit-rev 56ae9f2)]]
- *next thing to do*, introduce proper gaussian prior
- that probably involves more parameters, as min/max isn't enough
- [2017-05-19 Fri 09:44] introduced gaussian prior
- commit: [[orgit-rev:~/phd/src/penning-analysis.project/bayesian-analysis/::bb39265][~/phd/src/penning-analysis.project/bayesian-analysis/ (magit-rev bb39265)]]
- now, let's plot the priors to see that the gaussian actually looks
  like it is supposed to look like (and maybe the jeffreys as well ...)
- okay then, there was a small mistake in the gaussians
- commit: [[orgit-rev:~/phd/src/penning-analysis.project/bayesian-analysis/::581f657][~/phd/src/penning-analysis.project/bayesian-analysis/ (magit-rev 581f657)]]
- need to rework the prior mechanism into something that is more
  generic, maybe make a class of it
- probably the way to go: method that specializes either on symbol
  (:certain, :jeffreys, :uniform) or object, like gaussian
- [2017-05-23 Tue 13:55] implementing parameter results for nlopt results
- so, how do I determine min max for nlopt results ? For mcmc results
  that was easy, since we could just take the min/max of the iteration values
- let's start by using the prior range and then maybe think of something else
- mmmh, laplacian-approximation-marginal-posterior doesn't work anymore for rho-m0 ?
- ok, I'm probably not copying the model and then the parameter set
  last for calculating the binned data stays
- let's see where I actually set parameters
- laplacian-approximation-marginal-posterior sets slots, but it makes copies, let's test
  if that could be the problem:
  #+BEGIN_SRC lisp :results none
  (in-package #:penning-analysis)



  (labels ((cmd (fmt-str &rest args)
             (mgl-gnuplot:command (apply #'format nil fmt-str args))))
    (mgl-gnuplot:with-session ()
      (cmd "reset")
      (cmd "set terminal wxt enhanced font 'Georgia,8' dashed")
      (ba::laplacian-approximation-marginal-posterior *res* 'fp::rho-m0 100 :on-center nil)
      (ba::laplacian-approximation-marginal-posterior *res* 'fp::om-c 100 :on-center nil)
      (mgl-gnuplot:plot*
       (list
        (mgl-gnuplot:data*
         (map 'list #'identity (ba::laplacian-approximation-marginal-posterior *res*
                                                            'fp::tof-offset 300
                                                            :on-center nil))
         "with steps"))) 
      (cmd "unset output")))
  #+END_SRC
- the above works w/o problems, so that shouldn't be it
- ok, it is probably the median setting that I do with :on-center t
- ok, solved that problem, now, if I compare om-c found with mcmc to
  the one found with nlopt, they differ by two Hz, wtf ??
- could this be a binning thing ?
- doesn't depend (that much) on number of bins
- ok, now I'm confused, the plot says exactly the same thing
- yeah, that was stupid, it's because the plots are offset differently
  as they have a different range -- *or are they* 
  #+BEGIN_SRC lisp :results none
  (-
   (ba:median
    (ba:get-parameter-info
     (ba:get-parameter-results *res-mcmc* :start 2000 :no-bins 100 :start 1000) 'fp:om-c))
   (ba:median
    (ba:get-parameter-info
     (ba:get-parameter-results *res-nlopt* :start 2000 :no-bins 100 :start 10000) 'fp:om-c)))


  (list
   (ba:absolute-error
    (ba:get-parameter-info
     (ba:get-parameter-results *res-mcmc* :start 2000 :no-bins 100 :start 1000
                               :confidence-level 0.9d0) 'fp:om-c))
   (ba:absolute-error
    (ba:get-parameter-info
     (ba:get-parameter-results *res-nlopt* :start 2000 :no-bins 100 :start 10000
                               :confidence-level 0.9d0) 'fp:om-c)))

  #+END_SRC
- let's get back to that, but first I need to have some accessor
  function to for ease of use:
- o.k., with that is seems obvious that is quite a difference 
- why then is the plot the same *--->* what am I doing when plotting ? 
- just for giggles, start changing the binning *->* that made it even worse
- ok, maybe that is actually what it is ... the fits are slightly different
- I should compare it to what LM gives as an answer to be sure it is actually ok
  #+BEGIN_SRC lisp
  (defparameter *test-file* (midas:read-mpet-midas-file "/data_analysis/midas-files/20160630/run277347.mid"))

  (defparameter *data*
    (tof-data:data *test-file* 1
                   :min-tof 20d0
                   :max-tof 50d0
                   :min-no-ions 1
                   :max-no-ions 5))

  (let ((params (fp:get-init-params-from-midas-file
                 ,*test-file* :om-c-deviation 4d0
                 :rho-m0-sampler '(ba:gaussian-sampler :sigma 1d-5)
                 :om-c-sampler '(ba:gaussian-sampler :sigma 1d0)
                 :tof-offset-min 0d0 :tof-offset-max 2d0
                 :rho-m0 4d-4
                 :rho-m0-min 2d-4
                 :rho-m0-max 6d-4)))
    (defparameter *res-nlopt*
      (ba:find-optimum
       (make-instance 'ba:nlopt :algorithm nlopt:+nlopt_ln_neldermead+)
       (apply #'make-instance 'fp:bayes-konig params)
       (ba:initialize-from-source 'fp:bayes-tof *data*))))



  (let+ ((lm-res (fp:om-c
                  (pa:fit-model
                   (pa:fit-run *test-file*
                               (make-instance 'pa:run-constraints :tof-range '(20d0 50d0)
                                                                  :no-ion-range '(1 5)
                                                                  :tof-bin-width 0.2d0) 
                               'fit-penning::konig :fit-rho-m0 t :rho-m0 5d-4 :om-m 38327.430373795476d0))))
         (p-results (ba:get-parameter-results *res-nlopt* :start 2000 :no-bins 30 :start 10000))
         (nl-res (ba:median (ba:get-parameter-info p-results 'fp:om-c))))
    (values (/ (- lm-res nl-res)  (ba:absolute-error (ba:get-parameter-info p-results 'fp:om-c)))))
  #+END_SRC

  #+RESULTS:
  : -0\.07924184698329063d0

- ok, I can live with that
*** let's plot it to make sure it worked
- iterations
  #+BEGIN_SRC lisp :results none
  (in-package #:fit-penning)

  (labels ((cmd (fmt-str &rest args)
             (mgl-gnuplot:command (apply #'format nil fmt-str args))))
    (mgl-gnuplot:with-session ()
      (cmd "reset")
      (cmd "set terminal x11 enhanced font 'Georgia,8' dashed")
      (ba:plot-iteration-values
       ,*mcmc-konig-result/1*
       :params-to-plot '(om-c)
       :start 0 :every 10)
      (cmd "unset output")))
  #+END_SRC
- distributions
  #+BEGIN_SRC lisp :results none
  (in-package #:fit-penning)

  (labels ((cmd (fmt-str &rest args)
               (mgl-gnuplot:command (apply #'format nil fmt-str args))))
      (mgl-gnuplot:with-session ()
        (cmd "reset")
        (cmd "set terminal x11 enhanced font 'Georgia,8' dashed")
        (ba:plot-parameter-distribution
         (ba:get-parameter-results *mcmc-konig-result/1* :no-bins 25 :start 1000) 'om-c)
        (cmd "unset output")))
  #+END_SRC

  #+RESULTS:
- result model
  #+BEGIN_SRC lisp :results none
  (in-package #:fit-penning)

  (labels ((cmd (fmt-str &rest args)
             (mgl-gnuplot:command (apply #'format nil fmt-str args))))
    (mgl-gnuplot:with-session ()
      (cmd "reset")
      (cmd "set terminal x11 enhanced font 'Georgia,8' dashed")
      (ba:plot-result-model (ba:get-parameter-results
  			   ,*mcmc-konig-result/1* 
  			   :start 1500))
      (cmd "unset output")))
#+END_SRC
